{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v3.21.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_11", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_14"}, "name": "input_14", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_235", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_235", "inbound_nodes": [[["input_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_236", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_236", "inbound_nodes": [[["conv2d_235", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_237", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_237", "inbound_nodes": [[["conv2d_236", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_238", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_238", "inbound_nodes": [[["conv2d_237", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_239", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_239", "inbound_nodes": [[["conv2d_238", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_240", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_240", "inbound_nodes": [[["conv2d_239", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_241", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_241", "inbound_nodes": [[["conv2d_240", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_242", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_242", "inbound_nodes": [[["conv2d_241", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_40", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_40", "inbound_nodes": [[["conv2d_242", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_39", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_39", "inbound_nodes": [[["conv2d_transpose_40", 0, 0, {}], ["conv2d_239", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_243", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_243", "inbound_nodes": [[["concatenate_39", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_244", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_244", "inbound_nodes": [[["conv2d_243", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_41", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_41", "inbound_nodes": [[["conv2d_244", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_40", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_40", "inbound_nodes": [[["conv2d_transpose_41", 0, 0, {}], ["conv2d_236", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_245", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_245", "inbound_nodes": [[["concatenate_40", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_246", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_246", "inbound_nodes": [[["conv2d_245", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_247", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_247", "inbound_nodes": [[["conv2d_246", 0, 0, {}]]]}], "input_layers": [["input_14", 0, 0]], "output_layers": [["conv2d_247", 0, 0]]}}, "training_config": {"loss": "bce_dice_loss", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "binary_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": false, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_235/kernel", "shape": [3, 3, 3, 8], "dtype": "float32"}, {"name": "conv2d_235/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_236/kernel", "shape": [3, 3, 8, 8], "dtype": "float32"}, {"name": "conv2d_236/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_237/kernel", "shape": [3, 3, 8, 8], "dtype": "float32"}, {"name": "conv2d_237/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_238/kernel", "shape": [3, 3, 8, 16], "dtype": "float32"}, {"name": "conv2d_238/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_239/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "conv2d_239/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_240/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "conv2d_240/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_241/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "conv2d_241/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_242/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_242/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_243/kernel", "shape": [3, 3, 32, 16], "dtype": "float32"}, {"name": "conv2d_243/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_244/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "conv2d_244/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_245/kernel", "shape": [3, 3, 16, 8], "dtype": "float32"}, {"name": "conv2d_245/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_246/kernel", "shape": [3, 3, 8, 8], "dtype": "float32"}, {"name": "conv2d_246/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_247/kernel", "shape": [1, 1, 8, 1], "dtype": "float32"}, {"name": "conv2d_247/bias", "shape": [1], "dtype": "float32"}, {"name": "conv2d_transpose_40/kernel", "shape": [2, 2, 16, 32], "dtype": "float32"}, {"name": "conv2d_transpose_40/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_transpose_41/kernel", "shape": [2, 2, 8, 16], "dtype": "float32"}, {"name": "conv2d_transpose_41/bias", "shape": [8], "dtype": "float32"}]}]}